registers-init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>registers-init</title>
<!-- 2015-01-30 Fri 22:57 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Toby Tripp" />
<link rel="stylesheet" href="https://maxcdn.bootstrapcdn.com/bootstrap/3.3.2/css/bootstrap.min.css">
<link rel="stylesheet" href="css/config.css">
<link rel="stylesheet" href="css/htmlize.css">
</head>
<body>
<div id="preamble" class="status">
<p><a accesskey="H" href="index.html">HOME</a></p>
</div>
<div id="content">
<h1 class="title">registers-init</h1>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Emacs Registers</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
Emacs registers are compartments where you can save text,
rectangles, positions, and other things for later use. Once you save
text or a rectangle in a register, you can copy it into the buffer
once, or many times; once you save a position in a register, you can
jump back to that position once, or many times.
</p>

<p>
Each register has a name that consists of a single character, which
we will denote by r; r can be a letter (such as ‘a’) or a number
(such as ‘1’); case matters, so register ‘a’ is not the same as
register ‘A’.
</p>

<p>
A register can store a position, a piece of text, a rectangle, a
number, a window configuration, or a file name, but only one thing
at any given time. Whatever you store in a register remains there
until you store something else in that register. To see what
register r contains, use M-x view-register
</p>
</blockquote>
<p>
<a href="https://www.gnu.org/software/emacs/manual/html_node/emacs/Registers.html">https://www.gnu.org/software/emacs/manual/html_node/emacs/Registers.html</a>
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Set Some Registers</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Jump to a register with: <code>C-x r j &lt;register&gt;</code>
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #f5deb3;">(</span><span style="color: #859900; font-weight: bold;">dolist</span> <span style="color: #b58900;">(</span>r `<span style="color: #268bd2;">(</span><span style="color: #dc322f;">(</span>?i <span style="color: #cb4b16;">(</span>file . ,<span style="color: #268bd2;">(</span>concat dotfiles-dir <span style="color: #2aa198;">"init.el"</span><span style="color: #268bd2;">)</span><span style="color: #cb4b16;">)</span><span style="color: #dc322f;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>set-register <span style="color: #268bd2;">(</span>car r<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>cadr r<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #f5deb3;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Toby Tripp</p>
<p class="date">Created: 2015-01-30 Fri 22:57</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
